Repository: ulsdevteam/pkp-clamav
Catalog: locale/*/locale.po
Languages: de, es, fr, it, pt, ro

# plugins.generic.clamav.description
source: Integrate OJS with ClamAV for uploaded submission files. Through this plugin, OJS can scan each submission file at the time of upload, and will reject files which have virus signatures known to ClamAV.
de: Integration von OJS mit ClamAV für hochgeladene Einreichungsdateien. Mit diesem Plugin kann OJS jede Einreichungsdatei während des Uploads scannen und Dateien ablehnen, die ClamAV bekannte Virussignaturen aufweisen.
es: Integrar OJS con ClamAV para los archivos de envío subidos. A través de este plugin, OJS puede escanear cada archivo de envío en el momento de subirlo, y rechazará los archivos que tengan firmas de virus conocidas por ClamAV.
fr: Intégrer OJS à ClamAV pour les fichiers de soumission téléchargés. Grâce à ce module, OJS peut analyser chaque fichier de soumission au moment du téléchargement et rejeter les fichiers dont la signature virale est connue de ClamAV.
it: Integrare OJS con ClamAV per i file di presentazione caricati. Tramite questo plugin, OJS può eseguire la scansione di ogni file di presentazione al momento del caricamento e rifiutare i file che presentano firme di virus note a ClamAV.
pt: Integrar OJS com a ClamAV para ficheiros de submissão carregados. Através deste plugin, OJS pode verificar cada ficheiro de submissão no momento do carregamento, e rejeitará os ficheiros que tenham assinaturas de vírus conhecidas pela ClamAV.
ro: Integrarea OJS cu ClamAV pentru fișierele trimise încărcate. Prin intermediul acestui plugin, OJS poate scana fiecare fișier trimis în momentul încărcării și va respinge fișierele care au semnături de virus cunoscute de ClamAV.

# plugins.generic.clamav.uploadBlocked
source: Clam Antivirus blocked this file due to the virus signature "{$threatname}".
de: Clam Antivirus blockierte diese Datei aufgrund der Virussignatur "{$threatname}".
es: Clam Antivirus bloqueó este archivo debido a la firma de virus "{$threatname}".
fr: Clam Antivirus a bloqué ce fichier en raison de la signature du virus "{$threatname}".
it: Clam Antivirus ha bloccato questo file a causa della firma del virus "{$threatname}".
pt: O Clam Antivirus bloqueou este ficheiro devido à assinatura do vírus "{$threatname}".
ro: Clam Antivirus a blocat acest fișier din cauza semnăturii virusului "{$threatname}".

# plugins.generic.clamav.manager.clamavSettings
source: Clam AV Settings
de: Clam AV Einstellungen
es: Configuración de Clam AV
fr: Paramètres de ClamAV
it: Impostazioni di Clam AV
pt: Configurações do Clam AV
ro: Setări Clam AV

# plugins.generic.clamav.manager.settings.description
source: <p>Please provide detail on how to execute Clam AV on your system. You must already have <a href="https://www.clamav.net/">Clam AV</a> installed.</p>
de: <p>Bitte geben Sie an, wie Sie Clam AV auf Ihrem System ausführen. Sie müssen <a href="https://www.clamav.net/">Clam AV</a> bereits installiert haben.</p>
es: <p>Por favor, proporcione detalles sobre cómo ejecutar Clam AV en su sistema. Debe tener ya instalado <a href="https://www.clamav.net/">Clam AV</a>.</p>
fr: <p>Veuillez fournir des détails sur la façon d'exécuter Clam AV sur votre système. Vous devez déjà avoir installé <a href="https://www.clamav.net/">Clam AV</a>.</p>
it: <p>Fornire informazioni dettagliate su come eseguire Clam AV sul sistema. È necessario che <a href="https://www.clamav.net/">Clam AV</a> sia già installato.</p>
pt: <p>Por favor, forneça detalhes sobre como executar a Clam AV no seu sistema. Deverá ter o <a href="https://www.clamav.net/">Clam AV</a> instalado.</p>
ro: <p>Vă rugăm să furnizați detalii despre cum să executați Clam AV în sistemul dumneavoastră. Trebuie să aveți deja instalat <a href="https://www.clamav.net/">Clam AV</a>.</p>

# plugins.generic.clamav.manager.settings.clamavPath
source: The system path to Clam AV's clamscan executable.
de: Der Systempfad zur ausführbaren Datei clamscan von Clam AV.
es: La ruta del sistema al ejecutable clamscan de Clam AV.
fr: Le chemin d'accès système à l'exécutable clamscan de Clam AV.
it: Il percorso di sistema dell'eseguibile clamscan di Clam AV.
pt: É necessário o caminho do sistema para o ficheiro executável Clamscan da Clam AV.
ro: Ruta de acces din sistem către executabilul clamscan al Clam AV.

# plugins.generic.clamav.manager.settings.clamavPathRequired
source: The system path to Clam AV's clamscan executable is required.
de: Der Systempfad zur ausführbaren Datei clamscan von Clam AV ist erforderlich.
es: Se requiere la ruta del sistema al ejecutable clamscan de Clam AV.
fr: Le chemin d'accès au système de l'exécutable clamscan de Clam AV est requis.
it: È richiesto il percorso di sistema dell'eseguibile clamscan di Clam AV.
pt: É necessário o caminho do sistema para o ficheiro executável Clamscan da Clam AV.
ro: Este necesară ruta sistemului către executabilul clamscan al Clam AV.

# plugins.generic.clamav.manager.settings.version
source: Clam AV version detected
de: Clam AV Version erkannt
es: Versión de Clam AV detectada
fr: Version de Clam AV détectée
it: Versione di Clam AV rilevata
pt: Versão Clam AV detectada
ro: Versiunea Clam AV detectată

# plugins.generic.clamav.manager.settings.noversion
source: Clam AV version not found.
de: Clam AV Version nicht gefunden.
es: No se ha encontrado la versión de Clam AV.
fr: Clam AV version non trouvée.
it: Versione di Clam AV non trovata.
pt: Versão Clam AV não encontrada.
ro: Versiunea Clam AV nu a fost găsită.

# plugins.generic.clamav.manager.settings.networkProblem
source: Problem connecting to the server.
de: Problem bei der Verbindung zum Server.
es: Problema de conexión con el servidor.
fr: Problème de connexion au serveur.
it: Problema di connessione al server.
pt: Problema de ligação ao servidor.
ro: Probleme de conectare la server.

# plugins.generic.clamav.manager.settings.clamExecutableVersion
source: Clam AV version:
es: Versión Clam AV:
fr: Version Clam AV :
it: Versione di Clam AV:
pt: Versão Clam AV:
ro: Versiunea Clam AV:

# plugins.generic.clamav.manager.settings.daemon
source: ClamAV Daemon
es: Demonio ClamAV
fr: Daemon Clam AV
it: Demone ClamAV
pt: Daemon ClamAV
ro: Daemonul ClamAV

# plugins.generic.clamav.manager.settings.daemon.description
source: If the clamd daemon is available on your system, you can use it to scan uploaded files instead of the clamscan executable. Unlike clamscan, the clamd daemon keeps its virus definitions in memory between scans, reducing latency.
de: Wenn der clamd-Daemon auf Ihrem System verfügbar ist, können Sie ihn zum Scannen hochgeladener Dateien anstelle der ausführbaren Datei clamscan verwenden. Im Gegensatz zu clamscan behält der clamd-Daemon seine Virendefinitionen zwischen den Überprüfungen im Speicher, was die Latenzzeit verringert.
es: Si el demonio clamd está disponible en su sistema, puede utilizarlo para escanear los archivos cargados en lugar del ejecutable clamscan. A diferencia de clamscan, el demonio clamd mantiene sus definiciones de virus en la memoria entre los escaneos, reduciendo la latencia.
fr: Si le daemon clamd est disponible sur votre système, vous pouvez l'utiliser pour analyser les fichiers téléchargés à la place de l'exécutable clamscan. Contrairement à clamscan, le daemon clamd conserve ses définitions de virus en mémoire entre les analyses, ce qui réduit la latence.
it: Se il demone clamd è disponibile sul sistema, è possibile utilizzarlo per la scansione dei file caricati al posto dell'eseguibile clamscan. A differenza di clamscan, il demone clamd mantiene in memoria le definizioni dei virus tra una scansione e l'altra, riducendo la latenza.
pt: Se o daemon clamd estiver disponível no seu sistema, pode utilizá-lo para verificar os ficheiros carregados em vez do executável clamscan. Ao contrário do clamscan, o daemon clamd mantém as suas definições de vírus na memória entre scans, o que reduz a latência.
ro: Dacă demonul clamd este disponibil în sistemul dvs., îl puteți utiliza pentru a scana fișierele încărcate în locul executabilului clamscan. Spre deosebire de clamscan, daemonul clamd păstrează definițiile de virus în memorie între scanări, reducând astfel latența.

# plugins.generic.clamav.manager.settings.clamavUseSocket
source: Connect to the Clam AV daemon instead?
de: Stattdessen mit dem Clam AV-Daemon verbinden?
es: ¿Conectar con el demonio Clam AV en su lugar?
fr: Se connecter au daemon Clam AV à la place ?
it: Collegarsi invece al demone Clam AV?
pt: Ligar ao daemon Clam AV em vez disso?
ro: Vă conectați în schimb la daemonul Clam AV?

# plugins.generic.clamav.manager.settings.clamavSocketPath
source: The system path to Clam AV's clamd.sock socket.
de: Der Systempfad zum Socket clamd.sock von Clam AV.
es: La ruta del sistema al socket clamd.sock de Clam AV.
fr: Le chemin d'accès système au socket clamd.sock de Clam AV.
it: Il percorso di sistema del socket clamd.sock di Clam AV.
pt: O caminho do sistema para a socket clamd.sock da Clam AV.
ro: Ruta sistemului către socket-ul clamd.sock al Clam AV.

# plugins.generic.clamav.manager.settings.clamSocketVersion
source: Clam AV version:
es: Versión Clam AV:
fr: Version Clam AV :
it: Versione di Clam AV:
pt: Versão Clam AV:
ro: Versiunea Clam AV:

# plugins.generic.clamav.manager.settings.advanced
source: Advanced
de: Erweiterte Einstellungen
es: Configuración avanzada
fr: Paramètres avancés
it: Impostazioni avanzate
pt: Configurações avançadas
ro: Setări avansate

# plugins.generic.clamav.manager.settings.clamavSocketTimeout
source: Timeout in seconds.
de: Zeitüberschreitung.
es: Tiempo de espera.
fr: Délai d'attente.
it: Timeout.
pt: Timeout.
ro: Timeout

# plugins.generic.clamav.manager.settings.clamavSocketTimeout.units
source: seconds
de: Sekunden
es: segundos
fr: secondes
it: secondi
pt: segundos
ro: secunde

# plugins.generic.clamav.manager.settings.allowUnscannedFiles
source: Allow or block unscanned files?
de: Nicht gescannte Dateien zulassen oder blockieren?
es: ¿Permitir o bloquear los archivos no escaneados?
fr: Autoriser ou bloquer les fichiers non scannés ?
it: Consentire o bloccare i file non scansionati?
pt: Permitir ou bloquear ficheiros não verificados?
ro: Permiteți sau blocați fișierele nescanate?

# plugins.generic.clamav.manager.settings.allowUnscannedFiles.allow
source: Allow Unscanned Files
de: Nicht gescannte Dateien zulassen
es: Permitir archivos no escaneados
fr: Autoriser les fichiers non scannés
it: Consentire i file non scansionati
pt: Permitir ficheiros não verificados
ro: Permiteți fișierele nescanate

# plugins.generic.clamav.manager.settings.allowUnscannedFiles.block
source: Block Unscanned Files
de: Nicht gescannte Dateien blockieren
es: Bloquear archivos no escaneados
fr: Bloquer les fichiers non scannés
it: Bloccare i file non scansionati
pt: Bloquear ficheiros não verificados
ro: Blocați fișierele nescanate

# plugins.generic.clamav.manager.settings.allowUnscannedFiles.detail
source: The advanced settings only apply to scans using the clam AV daemon. If a scan of a file takes longer than the timeout setting, the scan will not complete. How the plugin treats these "unscanned files" is determined by the second setting. Allowing these unscanned files means that files that cannot be scanned in time will be successfully uploaded; blocking unscanned files means that files that cannot be scanned will be blocked and cannot be uploaded. Blocking files when they cannot be scanned is safer, but may cause problems for legitimate users.
de: Wenn die Überprüfung einer Datei länger dauert als die eingestellte Zeitüberschreitung oder ein Fehler während des Überprüfungsvorgangs auftritt, wird die Überprüfung nicht abgeschlossen. Wie das Plugin mit diesen "nicht gescannten Dateien" umgeht, wird durch die zweite Einstellung bestimmt. Das Zulassen dieser nicht gescannten Dateien bedeutet, dass Dateien, die nicht rechtzeitig gescannt werden können, erfolgreich hochgeladen werden; das Blockieren von nicht gescannten Dateien bedeutet, dass Dateien, die nicht gescannt werden können, blockiert werden und nicht hochgeladen werden können. Das Blockieren von Dateien, die nicht gescannt werden können, ist sicherer, kann aber Probleme für legitime Benutzer verursachen.
es: Si el escaneo de un archivo tarda más que el ajuste de tiempo de espera o hay un error durante el proceso de escaneo, el escaneo no se completará. La forma en que el plugin trata estos "archivos no escaneados" está determinada por el segundo ajuste. Permitir estos archivos no escaneados significa que los archivos que no pueden ser escaneados a tiempo serán cargados con éxito; bloquear los archivos no escaneados significa que los archivos que no pueden ser escaneados serán bloqueados y no podrán ser cargados. Bloquear los archivos cuando no pueden ser escaneados es más seguro, pero puede causar problemas a los usuarios legítimos.
fr: Si l'analyse d'un fichier prend plus de temps que le paramètre de délai d'attente ou si une erreur survient au cours du processus d'analyse, l'analyse ne sera pas terminée. La façon dont le plugin traite ces "fichiers non analysés" est déterminée par le deuxième paramètre. Autoriser ces fichiers non analysés signifie que les fichiers qui ne peuvent pas être analysés à temps seront téléchargés avec succès ; bloquer les fichiers non analysés signifie que les fichiers qui ne peuvent pas être analysés seront bloqués et ne pourront pas être téléchargés. Le blocage des fichiers qui ne peuvent pas être analysés est plus sûr, mais peut causer des problèmes aux utilisateurs légitimes.
it: Se la scansione di un file dura più a lungo del timeout impostato o se si verifica un errore durante il processo di scansione, la scansione non viene completata. Il modo in cui il plugin tratta questi "file non scansionati" è determinato dalla seconda impostazione. Consentire questi file non scansionati significa che i file che non possono essere scansionati in tempo saranno caricati con successo; bloccare i file non scansionati significa che i file che non possono essere scansionati saranno bloccati e non potranno essere caricati. Bloccare i file che non possono essere scansionati è più sicuro, ma può causare problemi agli utenti legittimi.
pt: Se o scan de um ficheiro demorar mais tempo do que o tempo limite definido ou se ocorrer um erro durante o processo de scan, o scan não será concluído. A forma como o plugin lida com estes "ficheiros não verificados" é determinada pela segunda configuração. Permitir estes ficheiros não verificados significa que os ficheiros que não podem ser verificados a tempo serão carregados com sucesso; bloquear ficheiros não verificados significa que os ficheiros que não puderem ser verificados serão bloqueados e não poderão ser carregados. O bloqueamento de ficheiros que não puderem ser verificados é mais seguro, mas pode causar problemas aos utilizadores legítimos.
ro: Dacă o scanare a unui fișier durează mai mult decât setarea timeout sau dacă apare o eroare în timpul procesului de scanare, scanarea nu se va finaliza. Modul în care pluginul tratează aceste "fișiere nescanate" este determinat de cea de-a doua setare. Permiterea acestor fișiere nescanate înseamnă că fișierele care nu pot fi scanate la timp vor fi încărcate cu succes; blocarea fișierelor nescanate înseamnă că fișierele care nu pot fi scanate vor fi blocate și nu vor putea fi încărcate. Blocarea fișierelor atunci când acestea nu pot fi scanate este mai sigură, dar poate cauza probleme pentru utilizatorii legitimi.
